{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 03. Работа с базами данных\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Вступление"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для этого урока вам понадобятся базы данных:\n",
    "    - SQLLite\n",
    "    - Redis\n",
    "    - Mongo DB\n",
    "    - Neo4j\n",
    "\n",
    "Вы можете установить их на своем компьютере. При этом, не забудьте обновить ссылки, логины и пароли на выбранные вами значения.\n",
    "\n",
    "Также, вы можете воспользоваться базами, размернутыми на нашем сервере. Все наобходимые настроки уже внесены в программный код, используемый в этом файле."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. Обзор баз данных (плоские файлы, SQL, NoSQL)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "С момента создания компьютеров накопление информации стало одной из важнейших возлагаемых на них задач. Накопленными данными надо управлять, обрабатывать и обновлять.\n",
    "Так появились системы управления базами данных (СУБД) — это программное обеспечение, позволяющее человеку осуществлять все необходимые действия с данными на высоком уровне, т.е. не думая о том, как на самом деле хранятся эти данные и что с ними происходит на физическом уровне.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Плоские файлы"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Самый простой вариант хранения структурированных данных - это плоские файлы. Свое название они получили потому, что имеют минимальную структуру. Если сравнить их со зданиями, то стены этого здания стоят на земле, а не на фундаменте.\n",
    "Плоский файл содержит в себе набор записей данных, которые записываются в определенном формате друг за другом. В файле находятся только данные и ничего кроме них, т.е. список. Файл не содержит метаданных (сведений о структуре хранимой информации).\n",
    "Вот пример такого файла.\n",
    "Первая строка - названия колонок.\n",
    "Вторая и далее - данные. \n",
    "Между собой значения колонок разделяются запятыми (или иным выбранным символом)\n",
    "Нужно самостоятельно разбираться какой тип имеет каждая колонка.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic1.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Такая форма хранения отлично подходит для простых списков, например email-адреса для рассылки или телефон+ФИО для обзвона.\n",
    "Но для более сложной информации не годятся. Например, неудобно хранить в плоском списке информацию, если одному ФИО соответствует несколько телефонов. Их придется перечислять через запятую или делать на каждое ФИО столько строк, сколько у него телефонных номеров.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Реляционная модель"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Название этой модели происходит от английского слова “relations”, т.е. “отношения”.\n",
    "Она появилась еще в 1970-х, как строгий математический способ структурирования, хранения и использования данных. \n",
    "Данные храняться в виде таблиц.Таблицы состоят из колонок и строк (кортежей). Для колонок задается тип и в них можно записывать данные только этого типа (нельзя как в Excel в одну ячейку ввести цифру, а в ячейке под ней написать “Примерно 1000 руб”).\n",
    "Отношения позволяют группировать данные как связанные наборы содержащие информацию (например, имя и адрес человека) и связанные с этим человеком атрибуты (его номер паспорта). \n",
    "\n",
    "Для работы с реляционными базами данных был разработан язык запросов SQL. Изначально он планировался как доступный после небольшой подготовки неспециалисту, близкий к живому английскому язык запросов. Например “Выбери всех сотрудников, у которых зарплата больше 100 000”. Но со временем этот язык дорабатывался и усложнялся, но основные команды остались легкими и понятными.\n",
    "Реляционная модель данных строго формализует структуру хранения данных. Если требуется хранить слабоструктурированные данные или разноплановые данные в каждой строке таблицы, то реляционная модель окажется излишне строгой и заставит проектировать гораздо больше таблиц. \n",
    "Реляционные базы лучше всего подходят для однотипных, формализованных данных. Например, каталоги и справочники, стандартизованные документы, которые редко меняются (как в РЖД). Эти базы позволяют быстро получить ответ на вопрос “В каком месяце были самые большие продажи” или “Какой товар самый популярный в этом квартале и какие клиенты покупали его”.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic2.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Неудобно хранить реляционной базе энциклопедию фильмов - человек может играть несколько ролей в одном фильме, одного героя могут играть несколько актеров (в детстве и зрелом возрасте). Или хранить разноплановые документы, приходящие из разных систем и часто меняющие свою структуру."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Безмодельный (NoSQL) подход"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Чтобы избавится от недостатков, вызванных строгостью реляционных баз, появится NoSQL-способ структуризации данных. \n",
    "Следует отметить, что NoSQL расшифровывается как Not Only SQL, т.е. “Не только SQL”. Он не отрицает запросы, но эти запросы не похожи на стандартный SQL.\n",
    "Базы данных NoSQL используют неструктуризированный подход, они предлагают много более эффективных способов хранения и обработки данных. Но каждый способ применим только в определенных ситуациях.\n",
    "Например, документо-ориентированные базы хранят информацию в виде иерархических структур данных. При этом они могут хранить объекты с произвольным набором атрибутов, отличающиеся друг от друга. \n",
    "То, что в реляционной БД необходимо разделить на множество взаимосвязанных таблиц, в NoSQL может храниться в виде одного объекта.\n",
    "\n",
    "Ниже рассмотрены виды NoSQL баз. Каждая из них оптимизирована для решения определенного круга задач."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Базы данных ключ-значение"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Этот тип БД работает только с данными похожими на словарь, ключ (слово) и значение (словарная статья по этому слову). В такой базе нет структур и связей. Подключившись к серверу приложение может задать ключ и его значение, а потом получить эти данные.\n",
    "Такие СУБД используются для быстрого сохранения базовых данных, к которым впоследствии нужен быстрый доступ. Такие базы очень быстры и легко масштабируемы.\n",
    "Отлично подходят для хранения данных пользовательской сессии на сайте, кеша, счётчиков посещений или просмотров и т.д.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic3.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Недостаток: Нет запросов и связей между ячейками, это именно хранилище данных. Такая база не ответит на вопрос “кто из посетителей сайта смотрел страницу с нашими новостями”."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Документо-ориентированные базы данных\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Этот тип баз данных ориентирован на хранение документов имеющих различную структуру в том виде “как есть”.\n",
    "Такие NoSQL СУБД допускают большую вложенность и сложность данных (например, документ вложенный в документ, вложенный в документ). Можно создать сколь угодно сложную структуру данных как документ и сохранить в базе.\n",
    "Эти СУБД имеют ряд своих особенностей. Она удобна для поиска в документах, но не для построения связей между ними.\n",
    "Такая база отлично подойдет под хранение данных о фильмах, из примера, приведенного выше или историй болезни.\n",
    "В базе хранятся коллекции, внутри коллекций - документы. А в документах в полях (field) хранится информация. Поле может быть отдельным документом, так что внутри документов могут быть вложенные документы."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic4.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Базы данных на основе графов"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Базы данных на основе графов хранят данные в древовидных структурах с узлами и связями соединяющими их. Некоторые операции удобнее (нагляднее) выполнять именно с таким представлением данных.\n",
    "Например, сведения о географических объектах. Загородный санаторий расположен вне населенных пунктов, но находится вблизи от трех городов, двух шоссе. Кроме того, вокруг него расположены интересные места, с которыми он тоже связан.\n",
    "Такая база не подойдет для хранения статистических табличных данных, т.е. время выполнения запросов по таким данным в реляционных базах гораздо больше."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic5.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Выводы"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Как мы увидели, для решение специфических задач, отличных от обработки статистики и хранения данных с жесткой структурой, существуют специализированные решения. \n",
    "Вытеснения реляционных баз и замены их новыми системами не произошло. И сегодня никто, кроме фанатов, не верит в это.\n",
    "NoSQL-решения хорошо справляются со своими задачами и часто работают в связке с реляционными базами. Например, данные по заказам, продажам, отгрузкам и оплатам хранятся в SQL-базе, сведения по документам в документной СУБД, а сведения о товарах в корзине пользователя интернет-магазина в системе ключ-значение.\n",
    "Одним словом, нужно подбирать инструмент под задачу."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. Работа с плоскими файлами"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Допустим, нам нужно сохранить ряд ссылок на сайты.\n",
    "Плоский файл вполне подходит для этого.\n",
    "\n",
    "Алгоритм действий таков:\n",
    "    - Открываем файл в нужном нам режиме (запись или чтение)\n",
    "    - Выполняем действия с файлом\n",
    "    - Закрываем файл. Если не закрыть файл, то он может стать недоступным для других программ (например, для открытия в Блокноте).\n",
    "\n",
    "Пример записи в файл:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "fName = 'my_data.txt' # Имя файла\n",
    "\n",
    "# Открываем файл в режиме \"запись\", если файла не существует, создается новый, задаем кодировку\n",
    "my_writefile = open(fName, mode=\"w\", encoding=\"utf-8\") \n",
    " \n",
    "my_writefile.write(\"Ссылка 1\\n\") # Добавляем несколько строк\n",
    "my_writefile.write(\"Ссылка 2\\n\") # \\n нужно добавлять, чтобы следующая запись началась с новой строки\n",
    "my_writefile.write(\"Ссылка 3\\n\")\n",
    "my_writefile.write(\"Ссылка 4\\n\")\n",
    "my_writefile.close() # Закрываем файл\n",
    "\n",
    "\n",
    "\n",
    "my_writefile = open(fName, mode=\"a\", encoding=\"utf-8\") # Открываем файл еще раз, информация добавляется в конец файла\n",
    " \n",
    "my_writefile.write(\"Link 1\\n\") # Добавляем несколько строк\n",
    "my_writefile.write(\"Link 2\\n\")\n",
    "my_writefile.write(\"Link 3\\n\")\n",
    "my_writefile.write(\"Link 4\\n\")\n",
    "my_writefile.close() # Закрываем файл\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Проверим что у нас получилось"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "my_readfile = open(fName, mode=\"r\", encoding=\"utf-8\") # Открываем файл в режиме \"Только чтение\"\n",
    "for line in my_readfile: # Перебираем строки в цикле\n",
    "    print(line)          # И печатаем их\n",
    "my_readfile.close()  # Закрываем файл"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для работы с плоскими файлами не требуется установка каких-либо дополнительных библиотек. Python умеет работать с файлами. Для работы с другими типами СУБД потребуются дополнительные библиотеки."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3. Работа с реляционными базами данных (на примере SQLite)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Язык SQL"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "SQLite (https://ru.wikipedia.org/wiki/SQLite) - бесплатная, встраиваемая, доступная для свободного использования СУБД, не требующая установки. Ее синтаксис максимально приближен к популярной СУДБ MySQL.\n",
    "\n",
    "SQLite подходит как для обучения, так и для реальной работы с данными.\n",
    "\n",
    "Основные действия, которые происходят в базах данных это:\n",
    "    - Добавление (Create)\n",
    "    - Чтение (Read)\n",
    "    - Изменение (Update)\n",
    "    - Удаление (Delete)\n",
    "\n",
    "Все эти действия описываются аббревиатурой CRUD. Но сначала нужно создать базу данных и таблицы в ней.\n",
    "\n",
    "Приведу в качестве примера две простые таблицы"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Клиенты\n",
    "<table class=\"table table-striped table-bordered\">\n",
    "<thead>\n",
    "    <tr><th>Идентификатор клиента (id_person)</th><th>ФИО Клиента</th></tr>\n",
    "</thead>\n",
    "<tr><td>1</td><td>Иванов Иван</td></tr>\n",
    "<tr><td>2</td><td>Сергеев Петр</td></tr>\n",
    "</table>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Телефоны\n",
    "<table class=\"table table-striped table-bordered\">\n",
    "<thead>\n",
    "    <tr><th>Идентификатор телефона (id_phone)</th><th>Идентификатор клиента (id_person)</th><th>Телефон</th></tr>\n",
    "</thead>\n",
    "<tr><td>1</td><td>1</td><td>+7 123-4455</td></tr>\n",
    "<tr><td>2</td><td>1</td><td>+7 123 6598</td></tr>\n",
    "<tr><td>3</td><td>2</td><td>+7 568-8989</td></tr>\n",
    "</table>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В первой таблице два клиента с идентификаторами 1 и 2.\n",
    "\n",
    "Во второй три телефона, два из них принадлежат клиенту с идентификатором 1, в третий клиенту с идентификатором 2.\n",
    "\n",
    "Это и называется отношениями (relations).\n",
    "\n",
    "Таблица с телефонами ссылается на номера клиентов.\n",
    "\n",
    "Создание таблицы имеет следующий синтаксис (упрощенный вариант, полный вариант гораздо объемнее):\n",
    "\n",
    "``` mysql\n",
    "CREATE TABLE IF NOT EXISTS table_name\n",
    "(\n",
    "  column_name1 datatype [ NULL | NOT NULL ]\n",
    "                   [ DEFAULT default_value ]\n",
    "                   [ AUTO_INCREMENT ]\n",
    "                   [ PRIMARY KEY ],\n",
    "  column_name2 datatype [ NULL | NOT NULL ]\n",
    "                   [ DEFAULT default_value ],\n",
    "  FOREIGN KEY index_name (index_col_name) REFERENCES another_table_name (index_col_name)\n",
    ")\n",
    "```\n",
    "\n",
    "Разберем подробнее:\n",
    "\n",
    "column_name1 - имя колонки.\n",
    "\n",
    "datatype - тип данных, которые будут хранится в этой колонке. Мы будем использовать типы INT (целые числа), DATETIME (Дата и время), VARCHAR(255) (Строка, в скобках указывается максимальная длина).\n",
    "\n",
    "NULL | NOT NULL  - Может ли колонка остаться незаполненной.\n",
    "\n",
    "DEFAULT default_value - значение по умолчанию, то значение, которое будет записано, если мы при добавлении записи не укажем его в явном виде.\n",
    "\n",
    "PRIMARY KEY - признак того, что это поле является идентификатором. В таблице может быть только одно поле с этим типом.  \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Скрипты для создания таблиц:\n",
    "\n",
    "``` mysql\n",
    "CREATE TABLE PRA_Person (\n",
    "id_person INTEGER NOT NULL PRIMARY KEY, # Идентификатор клиента\n",
    "\n",
    "\tfirst_name VARCHAR(255) NOT NULL, # Фамилия\n",
    "    \n",
    "\tlast_name VARCHAR(255) NULL, # Имя\n",
    "    \n",
    "\tage INTEGER,  # Возраст\n",
    "    \n",
    "\tdatecreate DATETIME DEFAULT CURRENT_TIMESTAMP # Дата добавления записи\n",
    "    \n",
    ");\n",
    "\n",
    "\n",
    "CREATE TABLE PRA_Phone (\n",
    "\n",
    "\tid_phone INTEGER NOT NULL PRIMARY KEY, # Идентификатор телефонного номера\n",
    "    \n",
    "\tid_person INTEGER  NOT NULL, # Идентификатор клиента\n",
    "    \n",
    "\tphone_num VARCHAR(255) NOT NULL , # Номер телефона\n",
    "    \n",
    "   FOREIGN KEY (id_person)  REFERENCES PRA_Person (id_person) # Внешний ключ - ссылка на таблицу клиентов\n",
    "   \n",
    ");\n",
    "``` "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Мы создаем внешний ключ. Он нужен для гарантии “ссылочной целостности” - после его создания СУБД не позволит поставить ссылку на несуществующий идентификатор клиента или удалить клиента, если по нему внесен телефон. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Добавление записей в таблицу:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "``` mysql\n",
    "INSERT INTO PRA_Person(first_name, last_name) VALUES('Иванов', 'Иван');\n",
    "\n",
    "INSERT INTO PRA_Person(first_name, last_name) VALUES('Сергеев', 'Петр');\n",
    "\n",
    "INSERT INTO PRA_Person(first_name, last_name) VALUES('Иванников', 'Захар');\n",
    "``` "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Сначала идет команда “INSERT INTO”. Регистр служебных слов не имеет значения.\n",
    "\n",
    "Потом имя таблицы “PRA_Person”, а за ним в круглых скобках перечень полей (колонок) в которые вставляются данные (в нашем случае это first_name, last_name).\n",
    "\n",
    "Потом “VALUES” , а за ним в круглых скобках вставляемые значения для каждой из колонок.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Проверим, что какие данные теперь в нашей таблице:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "``` mysql\n",
    "SELECT * FROM PRA_Person;\n",
    "``` "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Команда выбора данных всегда начинается со слова “SELECT”, потом перечень полей, которые мы хотим вернуть или знач *, если хотим получить все поля из таблицы, а потом имя самой таблицы."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Как видно, поля id_person автоматически заполняются цифрами-идентификаторами (это поле у нас AUTO_INCREMENT), а в поля datecreate автоматически заносится дата-время добавления записи в таблицу (при создании таблицы мы указали значение по умолчанию DEFAULT CURRENT_TIMESTAMP)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "В запрос можно добавить условия:\n",
    "    \n",
    "``` mysql\n",
    "SELECT * FROM PRA_Person WHERE first_name = 'Иванов';\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Этот запрос вернет нам все строки таблицы, в которых в поле first_name записано 'Иванов'."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "А этот вернет все строки, где фамилия начинается с букв “Ива”:\n",
    "    \n",
    "``` mysql\n",
    "SELECT * FROM PRA_Person WHERE first_name LIKE 'Ива%';\n",
    "``` "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Возможные условия:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic_t3.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Внимание: незаданное значение - это Null. Для всез типов данных.\n",
    "\n",
    "Для типа INT 0 и Null это разные вещи.\n",
    "\n",
    "Для типа VARCHAR пустая строка (две одиночные кавычки подряд - ‘’) и Null - тоже разные вещи.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Обновление данных:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "``` mysql\n",
    "UPDATE PRA_Person SET age = 30, last_name = 'Петр' WHERE first_name = 'Иванов';\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Команда UPDATE, потом имя таблицы, потом SET, потом перечисление “Имя поля” = “Новое значение” через запятую.\n",
    "\n",
    "В конце - условия, как в команде SELECT."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Удаление  данных:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "``` mysql\n",
    "DELETE FROM PRA_Person WHERE first_name = 'Иванов';\n",
    "``` \n",
    "\n",
    "Команда DELETE, потом имя таблицы, потом условия, как в команде SELECT.\n",
    "\n",
    "Также существует команда, позволяющая сразу сделать выборку из таблицы и вставить результат в другую таблицу\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Вставка в таблицу результата выборки:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "``` mysql\n",
    "INSERT INTO PRA_Phone(id_person, phone_num) SELECT id_person, '+7 111-1122' FROM PRA_Person WHERE first_name = 'Иванов';\n",
    "``` \n",
    "\n",
    "В этом скрипте вы выбираем идентификатор Иванова и используем его при вставке в таблицу с телефонами."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Очистим таблицы и заполним тестовыми данными"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Сначала попробуйте выполнить скрипт (удалить всех клиентов)\n",
    "\n",
    "``` mysql\n",
    "DELETE FROM PRA_Person;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "База выдаст сообщение об ошибке, т.к. в нас есть телефоны связанные с клиентами. Удаление клиентов приведет к нарушению ссылочной целостности (ссылки на клиентов в таблице телефонов будет указывать на несуществующие записи)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Нужно делать так\n",
    "\n",
    "``` mysql\n",
    "DELETE FROM PRA_Phone; # Удаляем сначала телефоны\n",
    "\n",
    "DELETE FROM PRA_Person; # А потом клиентов\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Снова вносим клиентов:\n",
    "\n",
    "``` mysql\n",
    "INSERT INTO PRA_Person(first_name, last_name) VALUES('Иванов', 'Иван');\n",
    "\n",
    "INSERT INTO PRA_Person(first_name, last_name) VALUES('Сергеев', 'Петр');\n",
    "\n",
    "INSERT INTO PRA_Person(first_name, last_name) VALUES('Иванников', 'Захар');\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "И телефоны по ним:\n",
    "\n",
    "``` mysql\n",
    "INSERT INTO PRA_Phone(id_person, phone_num) SELECT id_person, '+7 111-1122' FROM PRA_Person WHERE first_name = 'Иванов';\n",
    "\n",
    "INSERT INTO PRA_Phone(id_person, phone_num) SELECT id_person, '+7 111-7788' FROM PRA_Person WHERE first_name = 'Иванов';\n",
    "\n",
    "INSERT INTO PRA_Phone(id_person, phone_num) SELECT id_person, '+7 333-4567' FROM PRA_Person WHERE first_name = 'Сергеев';\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Обратите внимание, у Иванова два телефона, у Сергеева - один, а у Иванцова нет ни одного."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Теперь наша задача получить телефонный справочник. Т.е. табличку с ФИО и телефонами."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Выполним такой запрос:\n",
    "    \n",
    "``` mysql\n",
    "SELECT Prs.id_person, Prs.first_name, last_name, phone_num\n",
    "\n",
    "FROM PRA_Person Prs\n",
    "\n",
    "JOIN PRA_Phone Ph ON Ph.id_person = Prs.id_person\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Как вы заметили, это усложненные вариант ужа знакомого нам SELECT.\n",
    "\n",
    "В нем использовано две таблицы одновременно (PRA_Person и PRA_Phone).\n",
    "\n",
    "Они соединены командой JOIN.\n",
    "\n",
    "Кроме того, для каждой таблицы указано короткое наименование или синоним/алиас (для PRA_Person алиас Prs, для PRA_Phone алиас Ph). Это служит для упрощения запроса, алиас обычно состоит из 1-4 символов."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Синтаксис JOIN таков\n",
    "\n",
    "``` mysql\n",
    "SELECT …\n",
    "\n",
    "FROM “Имя первой таблицы” “Алиас первой таблицы”\n",
    "\n",
    "JOIN “Имя второй таблицы” “Алиас второй таблицы” \n",
    "\n",
    "ON “Алиас первой таблицы”.”Поле для связи таблиц” =  “Алиас второй таблицы”.”Поле для связи таблиц”\n",
    "\n",
    "“Поле для связи таблиц” - это то самое поле, в котором указывается идентификатор.\n",
    "```  \n",
    "\n",
    "В запросе \n",
    "\n",
    "``` mysql\n",
    "SELECT Prs.id_person, Prs.first_name, last_name, phone_num\n",
    "``` \n",
    "\n",
    "в некоторых случаях кроме имени поля указан алиас таблицы. Дело в том, что разные таблицы могут содержать поля с одинаковыми именами. Поэтому, чтобы избежать ошибки, следует явно указывать из какой таблицы берется это поле. Поля с наименованиями last_name и phone_num есть только в одной таблице, так что для них алиас можно не указывать. Но хорошим тоном считается всегда указывать алиас.\n",
    "\n",
    "\n",
    "Посмотрим, что нам вернул этот запрос.\n",
    "\n",
    "Он вернул только тех клиентов, у которых указан телефон. Что делать, если нужно получить полный список клиентов, даже тех, у которых нет телефона?\n",
    "\n",
    "Для этого служит запрос LEFT JOIN\n",
    "\n",
    "Он вернет все данные из левой таблицы (это та таблица, что встретилась в запросе первой, в нашем случае PRA_Person), а потом по возможности добавит к ним данные из правой (PRA_Phone) таблицы. Где нет данных - будет Null\n",
    "\n",
    "\n",
    "Запрос примет такой вид:\n",
    "\n",
    "``` mysql\n",
    "SELECT Prs.id_person, Prs.first_name, last_name, phone_num\n",
    "FROM PRA_Person Prs\n",
    "LEFT JOIN PRA_Phone Ph ON Ph.id_person = Prs.id_person\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Группировка значений"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Часто возникает задача сгруппировать данные и узнать, сколько всего значений задано для группы, максимальное/минимальное значение и сумму.\n",
    "\n",
    "Для группировки используется оператор GROUP BY, в сочетании с агрегатными функциями (COUNT, MAX, MIN, SUM, AVG).<br/>\n",
    "    - COUNT - количество значений\n",
    "    - MAX - максимальное значение\n",
    "    - MIN - минимальное значение\n",
    "    - SUM - сумма\n",
    "    - AVG - среднее значение\n",
    "    \n",
    "Группировка может проводится по одному или несколькими столбцами.\n",
    "\n",
    "Сгруппируем данные нашего справочника по клиентам и узнаем, сколько у каждого из них телефонных номеров, сколько раз им звонили и какое максимальное количество звонков на один номер они приняли.\n",
    "\n",
    "``` mysql\n",
    "SELECT Prs.id_person, Prs.first_name, Prs.last_name, \n",
    "    COUNT(phone_num) as phone_count, \n",
    "    max(calls_count) as max_calls_count, \n",
    "    sum(calls_count) as sum_calls_count\n",
    "FROM RPA_Person Prs\n",
    "LEFT JOIN RPA_Phone Ph ON Ph.id_person = Prs.id_person\n",
    "GROUP BY Prs.id_person, Prs.first_name, Prs.last_name\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Индексы в таблице"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для ускорения поиска в SQL-базах создают индексы. Индекс - это подобие алфавитного указателя в конце книги. Если мы ходим найти какую-то тему, то смотрим в алфавитный указатель и узнаем, на какой странице она описана.\n",
    "\n",
    "Индекс ускоряют запросы SELECT, но замедляют операторы UPDATE и INSERT, т.к. после каждого изменения данных индексы перестраиваются заново. На больших базах программисты используют такую хитрость: перед внесением большого числа изменений удаляют индекс, а после внесения - восстанавливают. Однократное переиндексирование позволяет сэкономить время.\n",
    "\n",
    "Создание или удаление индексов не влияет на сохраненые данные.\n",
    "\n",
    "Синтаксис создания индекса<br/>\n",
    "``` mysql\n",
    "CREATE INDEX IF NOT EXISTS index_name ON table_name(column_name);\n",
    "```  \n",
    "\n",
    "Синтаксис удаления индекса<br/>\n",
    "``` mysql\n",
    "DROP INDEX IF EXIST index_name;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Работа через Python-библиотеку"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для доступа к базе данных будем использовать библиотеку sqlite3.\n",
    "Это стандартная библиотека Python, не требующая отдельной установки.\n",
    "\n",
    "Алгоритм выполнения запросов на чтение данных такой:\n",
    "    - Создаем соединение с базой. После подключения получаем объект “соединение”\n",
    "    - Получаем “курсор” из объекта “соединение”\n",
    "    - Вызываем метод execute() у курсора\n",
    "    - Вызываем метод fetchall() у курсора и получаем объект “строки данных”;\n",
    "    - Закрываем “курсор”\n",
    "    - Работаем с объектом “строки данных”;\n",
    "    - Закрываем “соединение”.\n",
    "\n",
    "Ниже код, который вернет нам содержимое таблицы Клиенты"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для красивого отображения данных воспользуемся готовой процедурой sqldataToTable - она преобразует данные в приятную для глаз HTML-таблицу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from IPython.display import HTML, display\n",
    "\n",
    "def sqldataToTable(data):\n",
    "    if len(data) == 0 : # Если запрос не вернул ни одногй строки - сообщаем об этом\n",
    "        display(HTML('<b>Нет данных</b>'))\n",
    "        return\n",
    "    \n",
    "    hdr = ''\n",
    "    dt = ''\n",
    "    for col in data[0].keys(): # Формируем заголовок таблицы\n",
    "        hdr = hdr + '<th>' + col + '</th>'\n",
    "\n",
    "    for row in data: # Проходим циклом по всем строкам\n",
    "        dt = dt + '<tr>'\n",
    "        for cell in row: # И формируем тело таблицы\n",
    "            dt = dt + '<td>' + str(cell) + '</td>'\n",
    "        dt = dt + '</tr>'\n",
    "            \n",
    "    display(HTML('<table>' + '<tr>' + hdr + '</tr>' + dt + '</table>')) # Выводим таблицу на экран"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sqlite3 # Загружаем библиотеку\n",
    "conn = sqlite3.connect(\"testDB2.sqlite\") # Создаем соединение с базой данных (файлом с именем McScv.sqlite)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<sqlite3.Cursor at 0x176012a00a0>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "# Создаем таблицу Клиенты\n",
    "cursor.execute(\"\"\"CREATE TABLE IF NOT EXISTS RPA_Person ( id_person INTEGER NOT NULL PRIMARY KEY,  \n",
    "first_name VARCHAR(255) NOT NULL,  \n",
    "last_name VARCHAR(255) NULL,  \n",
    "age INTEGER,   \n",
    "datecreate DATETIME DEFAULT CURRENT_TIMESTAMP  \n",
    ")\"\"\")\n",
    "\n",
    "# Создаем таблицу Телефоны\n",
    "cursor.execute(\"\"\"CREATE TABLE IF NOT EXISTS RPA_Phone (\n",
    "id_phone INTEGER NOT NULL PRIMARY KEY,  \n",
    "id_person INTEGER  NOT NULL,  \n",
    "phone_num VARCHAR(255) NOT NULL , \n",
    "calls_count INTEGER,\n",
    "FOREIGN KEY (id_person) REFERENCES PRA_Person (id_person)  \n",
    ")\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<sqlite3.Cursor at 0x176012a00a0>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Создаем индекс в таблице клиентов по колонке first_name \n",
    "cursor.execute(\"CREATE INDEX IF NOT EXISTS index_first_name ON RPA_Person(first_name)\")\n",
    "\n",
    "# Создаем индекс в таблице телефонов по колонке phone_num \n",
    "cursor.execute(\"CREATE INDEX IF NOT EXISTS index_phone_num ON RPA_Phone(phone_num)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "cursor.execute(\"DELETE FROM RPA_Phone;\") # Очищаем таблицу телефонов\n",
    "cursor.execute(\"DELETE FROM RPA_Person;\") # Очищаем таблицу клиентов\n",
    "\n",
    "# Вносим клиентов\n",
    "cursor.execute(\"INSERT INTO RPA_Person(first_name, last_name) VALUES('Иванов', 'Иван');\")\n",
    "cursor.execute(\"INSERT INTO RPA_Person(first_name, last_name) VALUES('Сергеев', 'Петр');\")\n",
    "cursor.execute(\"INSERT INTO RPA_Person(first_name, last_name) VALUES('Иванников', 'Захар');\")\n",
    "\n",
    "# И телефоны по ним:\n",
    "cursor.execute(\"INSERT INTO RPA_Phone(id_person, phone_num, calls_count) SELECT id_person, '+7 111-1122', 50 FROM RPA_Person WHERE first_name = 'Иванов';\")\n",
    "cursor.execute(\"INSERT INTO RPA_Phone(id_person, phone_num, calls_count) SELECT id_person, '+7 111-7788', 60 FROM RPA_Person WHERE first_name = 'Иванов';\")\n",
    "cursor.execute(\"INSERT INTO RPA_Phone(id_person, phone_num, calls_count) SELECT id_person, '+7 333-4567', 70 FROM RPA_Person WHERE first_name = 'Сергеев';\")\n",
    "\n",
    "conn.commit() # Сохраняем измененения в базе\n",
    "\n",
    "cursor.close() # Закрываем “курсор”"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Иванов Иван None\n",
      "Сергеев Петр None\n",
      "Иванников Захар None\n"
     ]
    }
   ],
   "source": [
    "conn.row_factory = sqlite3.Row # Выбираем режим, при котором можно обращаться к полям запроса по именам\n",
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "\n",
    "cursor.execute(\"SELECT * FROM RPA_Person\") # Выполняем запрос\n",
    "rows = cursor.fetchall() # Получаем объект “строки данных”\n",
    "\n",
    "for row in rows: # Проходим циклом по всем строкам\n",
    "    print(row['first_name'], row['last_name'], row['age']) # Обратится к полю можно указав его имя - row['first_name']\n",
    "    \n",
    "cursor.close() # Закрываем “курсор”"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Как быть, если мы хотим задать условия для запроса?\n",
    "\n",
    "Разумеется можно написать \n",
    "``` mysql\n",
    "cursor.execute(\"SELECT * FROM PRA_Person WHERE first_name = 'Иванов'\")  \n",
    "```\n",
    "И запрос отработает, но это не самый лучший вариант."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Лучший вариант более громоздкий, зато его удобно использовать при многократных вызовах."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Иванов Иван None\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table><tr><th>id_person</th><th>first_name</th><th>last_name</th><th>age</th><th>datecreate</th></tr><tr><td>1</td><td>Иванов</td><td>Иван</td><td>None</td><td>2019-10-13 19:45:38</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "conn.row_factory = sqlite3.Row # Выбираем режим, при котором можно обращаться к полям запроса по именам\n",
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "# Текст запроса с параметрами\n",
    "# параметр начинается двоеточия :first_name\n",
    "# в скобках указывается его название\n",
    "query = \"SELECT * FROM RPA_Person WHERE first_name=:first_name\"\n",
    "\n",
    "# Аргументы, которые мы подставим в запрос\n",
    "# Первым идет имя параметра, вторым его значение\n",
    "# Если значение - строка, то заключаем его в одиночные кавычки\n",
    "args = {'first_name' : 'Иванов'}  \n",
    "cursor.execute(query, args) # Выполняем запрос, передав ему аргументы\n",
    "rows = cursor.fetchall() # Получаем объект “строки данных”\n",
    "\n",
    "for row in rows:  \n",
    "    print(row['first_name'], row['last_name'], row['age'])   # Выводим интересующие нас колонки на экран \n",
    "sqldataToTable(rows) # Выводим все колонки в виде таблицы\n",
    "\n",
    "cursor.close() # Закрываем “курсор”"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Выполним запрос с группировкой - узнаем, сколько у каждого клиента телефонных номеров, сколько раз им звонили и какое максимальное количество звонков на один номер они приняли."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 Иванников Захар 0 None None\n",
      "1 Иванов Иван 2 60 110\n",
      "2 Сергеев Петр 1 70 70\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table><tr><th>id_person</th><th>first_name</th><th>last_name</th><th>phone_count</th><th>max_calls_count</th><th>sum_calls_count</th></tr><tr><td>3</td><td>Иванников</td><td>Захар</td><td>0</td><td>None</td><td>None</td></tr><tr><td>1</td><td>Иванов</td><td>Иван</td><td>2</td><td>60</td><td>110</td></tr><tr><td>2</td><td>Сергеев</td><td>Петр</td><td>1</td><td>70</td><td>70</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "conn.row_factory = sqlite3.Row # Выбираем режим, при котором можно обращаться к полям запроса по именам\n",
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "cursor.execute(\"\"\"SELECT Prs.id_person, Prs.first_name, Prs.last_name, COUNT(phone_num) as phone_count, max(calls_count) as max_calls_count, sum(calls_count) as sum_calls_count \n",
    "FROM RPA_Person Prs \n",
    "LEFT JOIN RPA_Phone Ph ON Ph.id_person = Prs.id_person \n",
    "GROUP BY Prs.id_person, Prs.first_name, Prs.last_name\"\"\") # Выполняем запрос\n",
    "rows = cursor.fetchall() # Получаем объект “строки данных”\n",
    "\n",
    "for row in rows: # Проходим циклом по всем строкам\n",
    "    print(row['id_person'], row['first_name'], row['last_name'], row['phone_count'], row['max_calls_count'], row['sum_calls_count'])  \n",
    "    \n",
    "sqldataToTable(rows) # Выводим все колонки в виде таблицы\n",
    "\n",
    "cursor.close() # Закрываем “курсор”"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Задание для самостоятельного выполнения"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "    - Получить и отобразите на экране идентификатор клиента, фамилия и имя клиента, номер его телефона и идентификатор телефона. Требуется отобразить всех клиентов, даже тех, у кого телефон не указан."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Алгоритм выполнения запросов на изменение и удаление данных (UPDATE и DELETE) почти такой же как на чтение:\n",
    "    - Создаем соединение с базой. После подключения получаем объект \"соединение\"\n",
    "    - У объекта \"соединение\" устанавливаем свойство autocommit = True, чтобы вносимые изменения сразу сохранялись в базе.\n",
    "    - Получаем \"курсор\" из объекта \"соединение\" (dictionary=True указывать не нужно)\n",
    "    - Вызываем метод execute() у курсора\n",
    "    - Закрываем \"курсор\"\n",
    "    - Закрываем \"соединение\".\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "conn.row_factory = sqlite3.Row # Выбираем режим, при котором можно обращаться к полям запроса по именам\n",
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "# Текст запроса\n",
    "query = \"UPDATE RPA_Person SET age = :age WHERE first_name=:first_name\"\n",
    "\n",
    "\n",
    "# Аргументы, которые мы подставим в запрос\n",
    "args = {'first_name' : 'Иванов', 'age' : 35}  \n",
    "cursor.execute(query, args) # Выполняем запрос, передав ему аргументы\n",
    "conn.commit() # Сохраняем измененения в базе\n",
    "\n",
    "cursor.execute(\"SELECT * FROM RPA_Person\")\n",
    "for row in cursor:\n",
    "    print(row['first_name'], row['last_name'], row['age'])\n",
    "    \n",
    "cursor.close() # Закрываем “курсор”"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Задание для самостоятельного выполнения"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "    - Переберите всех клиентов, если у клиента не задан возраст - задайте 0 лет.\n",
    "    - Если возраст задан - добавьте ему телефон \"+7 916 555-4433\"\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4. Работа с СУБД Ключ - значение (на примере Redis)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Возможности Redis"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "У этой базы не так много возможностей, как у SQL баз.\n",
    "\n",
    "Три основных действия - это установка значения (SET), получение значения (GET) и удаление пары ключ-значение (DELETE).\n",
    "\n",
    "\n",
    "Возможные еще три дополнительных действия: увеличение и уменьшение числового значения на заданную величину (INCR и DECR) и добавление к строке новых символов (APPEND)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Работа через Python-библиотеку"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для доступа к базе данных будем использовать библиотеку redis.\n",
    "\n",
    "Кроме перечисленных выше операций она умеет создавать буфер команд (pipeline). Все команды из этого буфера выполняются пакетом. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Установим библиотеку"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "! pip3 install redis "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Код с комментариями позволит понять все демонстрируемые возможности:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "b'5'\n",
      "3\n",
      "13\n",
      "None\n",
      "Привет\n",
      "Привет, Мир!\n",
      "b'2 + 5 = 7'\n",
      "None\n"
     ]
    }
   ],
   "source": [
    "import redis # Подключаем библиотеку redis\n",
    "\n",
    "r = redis.StrictRedis(host='localhost', port=6379, db=1) # Подключаемся к базе\n",
    "\n",
    "r.set('Val1', 5) # Присваиваем переменной Val1 значение 5\n",
    "\n",
    "print(r.get('Val1')) # Получаем значение переменной Val1 \n",
    "\n",
    "print(r.decr('Val1', 2)) # Уменьшаем значение Val1 на 2 - выдаст 3\n",
    " \n",
    "print(r.incr('Val1', 10)) # Увеличиваем значение Val1 на 10 - выдаст 13\n",
    "\n",
    "r.delete('Val1') # Удаляем переменную Val1  \n",
    "\n",
    "print(r.get('Val1')) # Получаем значение переменной Val1 - Оно очищено\n",
    "\n",
    "\n",
    "r.set('Val2', 'Привет') # Присваиваем переменной Val2 значение Hello\n",
    "print(r.get('Val2').decode(\"utf-8\"))  # Получаем значение переменной Val2 \n",
    "\n",
    "r.append('Val2', ', Мир!')  # Добавляем к значению переменной Val2 значение 'Мир!\n",
    "print(r.get('Val2').decode(\"utf-8\") ) # Получаем значение переменной Val2 \n",
    "\n",
    "\n",
    "pipe = r.pipeline() # Создаем буфер команд\n",
    "pipe.set('Val3', '2')  # Присваиваем переменной Val2 значение 2\n",
    "pipe.append('Val3', ' + 5') # Добавляем к значению переменной Val2 '+ 5'\n",
    "pipe.append('Val3', ' = 7') # Добавляем к значению переменной Val2 '= 7'\n",
    "pipe.execute() # Запускаем выполнение всех команд\n",
    "print(r.get('Val3')) # Получаем значение переменной Val3 \n",
    "\n",
    "r.bgsave() # Сохраняем все данные на диск\n",
    "\n",
    "r.flushdb() # Очищаем всю выбраную базу\n",
    " \n",
    "print(r.get('Val3')) # Получаем значение переменной Val3 - его нет (мы уже очистили базу)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4. Работа с документоориентированной СУБД (на примере MongoDB) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Возможности MongoDB"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Работа с документоориентированными базами отличается от работы с реляционными базами тем, что нужно работать не с таблицами и их полями, а с документом целиком.\n",
    "\n",
    "Добавление документа выглядит так\n",
    "\n",
    "``` mysql\n",
    "db.collection.insert_one( { \"name\" : \"Иванов Иван\", \"age\" : 25 } );\n",
    "```  \n",
    "\n",
    "Поиск документа по одному параметру\n",
    "``` mysql\n",
    "db.collection.find({\"name\": \"Иванов Иван\"});\n",
    "```  \n",
    "\n",
    "Поиск документа по нескольким параметрам\n",
    "``` mysql\n",
    "db.collection.find({\"name\": \"Иванов Иван\", \"age\" : 25});\n",
    "```  \n",
    "\n",
    "Если мы хотим вернуть не весь документ, а только отдельные поля, их нужно оказать в дополнительных\n",
    "\n",
    "``` mysql\n",
    "db.collection.find({\"age\" : 25}, {\"name\" : 1});\n",
    "``` \n",
    "\n",
    "В запросах можно указывать не только строгие равенства, но и больше/меньше.\n",
    "\n",
    "Операторы: \n",
    "\n",
    "    $lt — меньше;\n",
    "    \n",
    "    $lte — меньше или равно;\n",
    "    \n",
    "    $gt — больше;  \n",
    "    \n",
    "    $gte — больше или равно; \n",
    "    \n",
    "    $ne — не равно.\n",
    "\n",
    "Поиск всех людей возврастом от 18 до 40 включительно:\n",
    "\n",
    "``` mysql\n",
    "db.collection.find({\"age\": { \"$gte\": 18, \"$lte\": 40 }} );\n",
    "``` \n",
    "\n",
    "Несколько условий можно объединить при помощи оператора $or.\n",
    "    \n",
    "``` mysql\n",
    "db.collection.find({\"$or\": [{ \"age\": 35}, { \"first_name\": \"Иванов Иван\" }]} )\n",
    "``` \n",
    "\n",
    "Функций для обновления данных в MongoDB несколько, под разные задачи. Все они вызываются одинаково\n",
    "\n",
    "``` mysql\n",
    "<method_name>({условия}, {документ для замены или обновления}, upsert=False)\n",
    "```\n",
    "upsert=True - если документ, соответствующий заданным условиям не найден, он будет вставлен.\n",
    "\n",
    "Варианты функций:\n",
    "\n",
    "    replace_one - заменяет первый документ, соответствующий условиям;    \n",
    "    update_one - обновляет первый документ, соответствующий условиям;    \n",
    "    update_many - обновляет все документы, соответствующие условиям.\n",
    "\n",
    "Для функций update_one и update_many следует использовать $-оператор ($set для установки значениа, $inc - для увеличения, $dec - для уменьшения, $unset - удаление поля)\n",
    "    \n",
    "``` mysql\n",
    "db.collection.update_one({\"age\" : 25}, {\"$set\":{\"age\": 30}})\n",
    "```\n",
    "\n",
    "``` mysql\n",
    "db.collection.update_many({\"age\" : 25}, {\"$set\":{\"age\": 30}})\n",
    "```  \n",
    "\n",
    "Для функций replace_one $-оператор не нужен\n",
    "    \n",
    "``` mysql\n",
    "db.collection.replace_one({\"age\" : 25}, {\"age\": 30})\n",
    "```  \n",
    "\n",
    "\n",
    "Для удаления документов служат функции^\n",
    "    \n",
    "    delete_one - удаляет первый документ, соответствующий условиям.\n",
    "    \n",
    "    delete_many - удаляет все документы, соответствующие условиям.\n",
    "\n",
    "Условия для них задаются точно так же.\n",
    "    \n",
    "``` mysql\n",
    "db.collection.delete_one({\"age\" : 25})\n",
    "    \n",
    "db.collection.delete_many({\"age\" : 25})\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Работа через Python-библиотеку"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Установим библиотеку"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "! pip3 install pymongo "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Небольшой пример, который позволит увидеть все вышеприведенные функции в деле"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим все документы из коллекции coll\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552c'), 'first_name': 'Шерлок', 'last_name': 'Холмс'}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552d'), 'first_name': 'Джон', 'last_name': 'Ватсон'}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552e'), 'first_name': 'Профессор', 'last_name': 'Мориарти'}\n"
     ]
    }
   ],
   "source": [
    "import pymongo\n",
    "from pymongo import MongoClient\n",
    "    \n",
    "client = MongoClient(port=27017)  # Подключаемся к базе\n",
    " \n",
    "db=client['MyTestBase'] # Выбираем базу данных. Если ее еще нет - будет создана автоматически\n",
    " \n",
    "coll = db['MyTestColl'] # Выбираем коллекцию документов. Если ее еще нет - будет создана автоматически\n",
    " \n",
    "doc = {\"first_name\":\"Шерлок\", \"last_name\":\"Холмс\"} # Добавляем документ из двух полей - Имя и фамилия\n",
    "coll.insert_one(doc)\n",
    " \n",
    "coll.insert_one({\"first_name\":\"Джон\", \"last_name\":\"Ватсон\"}) # Другой вариант добавления документа\n",
    "coll.insert_one({\"first_name\":\"Профессор\", \"last_name\":\"Мориарти\"})  \n",
    " \n",
    "print('Выводим все документы из коллекции coll')\n",
    "for men in coll.find(): # Выводим все документы из коллекции coll\n",
    "    print (men)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим фамилии людей с именем Джон\n",
      "Джон Ватсон\n"
     ]
    }
   ],
   "source": [
    "print('Выводим фамилии людей с именем Джон')\n",
    "for men in coll.find({\"first_name\": \"Джон\"}):\n",
    "    print (men[\"first_name\"], men[\"last_name\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим только фамилии\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552c'), 'last_name': 'Холмс'}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552d'), 'last_name': 'Ватсон'}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552e'), 'last_name': 'Мориарти'}\n"
     ]
    }
   ],
   "source": [
    "print('Выводим только фамилии')\n",
    "for men in coll.find({ },{\"last_name\": 1}):\n",
    "    print (men)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим количество людей с именем Джон\n",
      "1\n"
     ]
    }
   ],
   "source": [
    "print('Выводим количество людей с именем Джон')\n",
    "print (coll.count_documents({\"first_name\": \"Джон\"} ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим обновленные документы\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552c'), 'first_name': 'Шерлок', 'last_name': 'Холмс', 'city': 'Лондон', 'age': 5}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552d'), 'last_name': 'Уотсон', 'age': 40}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552e'), 'first_name': 'Профессор', 'last_name': 'Мориарти', 'city': 'Лондон', 'age': 5}\n"
     ]
    }
   ],
   "source": [
    "coll.update_many({}, {\"$set\":{\"city\": \"Лондон\"}}) # Добавляем ко всем документам новое поле city - город\n",
    " \n",
    "coll.replace_one({\"first_name\": \"Джон\"}, {\"last_name\": \"Уотсон\", \"age\": 35}) # Первому Джону очищаем данные, ставим фамилию Уотсон и возраст 35 лет\n",
    " \n",
    "coll.update_many({ }, {\"$inc\": {\"age\": 5}}) # Увеличиваем всем возраст на 5 лет\n",
    " \n",
    "print('Выводим обновленные документы')\n",
    "for men in coll.find(): # Выводим все документы из коллекции coll\n",
    "    print (men)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выбираем всех с именем Шерлок или фамилией Мориарти\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552c'), 'first_name': 'Шерлок', 'last_name': 'Холмс', 'city': 'Лондон', 'age': 5}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552e'), 'first_name': 'Профессор', 'last_name': 'Мориарти', 'city': 'Лондон', 'age': 5}\n"
     ]
    }
   ],
   "source": [
    "print('Выбираем всех с именем Шерлок или фамилией Мориарти')\n",
    "for men in coll.find({\"$or\": [{ \"last_name\": \"Мориарти\"}, { \"first_name\": \"Шерлок\" }]} ) :\n",
    "    print (men)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим обновленные документы\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552c'), 'last_name': 'Холмс', 'city': 'Лондон', 'age': 5}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552d'), 'last_name': 'Уотсон', 'age': 40}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552e'), 'last_name': 'Мориарти', 'city': 'Лондон', 'age': 5}\n"
     ]
    }
   ],
   "source": [
    "coll.update_many({}, {\"$unset\": {\"first_name\": 1}}) # Удаляет у всех документов поле first_name\n",
    " \n",
    "print('Выводим обновленные документы')\n",
    "for men in coll.find(): # Выводим все документы из коллекции coll\n",
    "    print (men)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим обновленные документы\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552c'), 'last_name': 'Холмс', 'city': 'Лондон', 'age': 5}\n",
      "{'_id': ObjectId('5d93a17f8f63cd126d39552e'), 'last_name': 'Мориарти', 'city': 'Лондон', 'age': 5}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<pymongo.results.DeleteResult at 0x21d48540f08>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# удаляем людей с возрастом более 20 лет\n",
    "coll.delete_many({\"age\": {\"$gt\": 20}})\n",
    " \n",
    "print('Выводим обновленные документы')\n",
    "for men in coll.find(): # Выводим все документы из коллекции coll\n",
    "    print (men)\n",
    "    \n",
    "# удаляем все документы коллекции\n",
    "coll.delete_many({})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Задание для самостоятельного выполнения"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "    - Исправьте эту ошибку (пусть у них вообще не будет возраста).\n",
    "    - Добавьте Мориарти статус “Умер”. \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 6. Работа с графовой СУБД (на примере Neo4j)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Возможности Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Как мы уже знаем, графовые СУБД предназначены для хранения информации о связях между объектами.\n",
    "\n",
    "Эти объекты называются “Вершинами”, а связи между ними “Ребрами графа”.\n",
    "Графы, в которых вершины соединены более чем одним ребром называют Мультиграфом, а такие ребра называются кратными или параллельными.\n",
    "В Neo4j ребра называют связями а вершины - нодами.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic6.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Neo4j позволяет хранить множество других атрибутов ноды и связи. В этом смысле они похожи на документ из MongoDB.\n",
    "\n",
    "\n",
    "Заполнение базы начинается с создание нод. \n",
    "\n",
    "Продолжим с героями предыдущего задания - Шерлоком и его близкими.\n",
    "\n",
    "\n",
    "Команда создания ноды выглядит так\n",
    "\n",
    "``` mysql\n",
    "CREATE (h_sh:persons { name: \"Шерлок Холмс\", profession: \"Сыщик\"})\n",
    "```\n",
    "h_sh - имя создаваемого объекта, его можно использовать в этом же скрипте для создания связей. Если вы не собираетесь его использовать (например, связи будут внесены позже), то можно не писать ничего.\n",
    "    persons - Это метка (тип) ноды.\n",
    "    name и profession - Атрибуты нашей ноды.\n",
    "\n",
    "Создадим Ватсона\n",
    "\n",
    "``` mysql\n",
    "CREATE (dr_vts:persons { name: \"Джон Ватсон\", profession: \"Врач\"})\n",
    "```\n",
    "\n",
    "Посмотрим, что сейчас хранится в нашей базе запросом\n",
    "``` mysql\n",
    "MATCH (n) RETURN n\n",
    "```\n",
    "MATCH и RETURN - ключевые слова.\n",
    "n - переменная, через которую мы получаем результаты.\n",
    "\n",
    "Сейчас две ноды в нашей базе никак не связаны межды собой."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic7.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Теперь нужно создать связь (точнее связи) между ними.\n",
    "\n",
    "Добавление связи в Neo4j делается через поиск\n",
    "\n",
    "``` mysql\n",
    "MATCH (h_sh:persons{name: \"Шерлок Холмс\"}), (dr_vts:persons { name: \"Джон Ватсон\"})\n",
    "\n",
    "with h_sh,dr_vts\n",
    "\n",
    "CREATE (h_sh)-[:friendship { }]->(dr_vts)\n",
    "```  \n",
    "\n",
    "Ищем человека (persons) по имени Шерлок Холмс (переменная h_sh) и человека по имени Джон Ватсон  (переменная dr_vts), берем эти переменные и создаем для них связь с типом “дружба” (friendship).\n",
    " \n",
    "Наш граф принял вид"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic8.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Но ведь Ватсон тоже дружит с Холмсом. Нужно построить обратную связь того же типа.\n",
    "\n",
    "``` mysql\n",
    "MATCH (h_sh:persons{name: \"Шерлок Холмс\"}), (dr_vts:persons { name: \"Джон Ватсон\"})\n",
    "\n",
    "with h_sh,dr_vts\n",
    "\n",
    "CREATE (dr_vts)-[:friendship { }]->(h_sh)\n",
    "```\n",
    "\n",
    "Скрипт очень похож на предыдущий, в команде добавления связи мы просто поменяли героев местами.\n",
    "\n",
    "Теперь их дружба стала взаимной"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic10.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Но ведь связи между этими людьми гораздо сложнее.\n",
    "\n",
    "Например, Ватсон описывает деятельность Холмса.\n",
    "\n",
    "Добавим и эту связь. \n",
    "\n",
    "``` mysql\n",
    "MATCH (h_sh:persons{name: \"Шерлок Холмс\"}), (dr_vts:persons { name: \"Джон Ватсон\"})\n",
    "\n",
    "with h_sh,dr_vts\n",
    "\n",
    "CREATE (dr_vts)-[:connect {comment:\"Описывает расследования\" }]->(h_sh)\n",
    "```  \n",
    "\n",
    "В команде добавления связи мы создали связь с типом “connect” и в ее свойствах указали атрибут тип (conn_type:\"Описывает расследования\")\n",
    "\n",
    "Теперь граф выглядит так\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic9.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Предположим, Ватсон перестал писать о Холмсе (но они не ссорились и остались друзьями). Удаляем связь “Описывает расследования” командой\n",
    "\n",
    "MATCH (x:persons {name:'Джон Ватсон'})-[r:connect{comment:\"Описывает расследования\"}]->(y) DETACH DELETE r\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic10.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Мы задали условия поиска “Связь Джона Ватсона с атрибутом comment равным “Описывает расследования” помещается в переменную r”, а затем удаляем эту переменную.\n",
    "\n",
    "Подобным же образом удаляется и нода. Удалим Холмса, а вместе с ним удаляются и связи\n",
    "\n",
    "``` mysql\n",
    "MATCH (n:persons{name: \"Шерлок Холмс\"})\n",
    "DETACH DELETE n\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic11.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Попробуем изменить и удалить атрибут ноды. Путь Ватсон будет по профессии не врачом, а доктором.\n",
    "\n",
    "``` mysql\n",
    "MATCH (n:persons{name: \"Джон Ватсон\") \n",
    "SET n.profession = 'Доктор' \n",
    "RETURN n\n",
    "```  \n",
    "\n",
    "А теперь вообще удалим упоминание о его профессии\n",
    "\n",
    "``` mysql\n",
    "MATCH (n:persons{name: \"Джон Ватсон\"}) \n",
    "REMOVE n.profession \n",
    "RETURN n\n",
    "```  \n",
    "\n",
    "У Ватсона осталось только имя\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"img/Pic12.png\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "И напоследок команда, которая удаляем все ноды и связи\n",
    "\n",
    "``` mysql\n",
    "MATCH (n) DETACH DELETE n\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Работа через Python-библиотеку"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Для работы с Neo4j будем использовать библиотеку neo4j\n",
    "\n",
    "Она устанавливается командой"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "! pip3 install neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Запускаем скрипт, который создаст Холмса и его окружение"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase # Подключаем библиотеку с драйвером БД\n",
    "\n",
    "# Соединяемся с базой\n",
    "graphDB_Driver  = GraphDatabase.driver(uri = \"bolt:localhost:7687\", auth=(\"neo4j\", \"2\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "База очищена\n"
     ]
    }
   ],
   "source": [
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    # Очищаем базу (на тот случай, если мы ее уже запускали)\n",
    "    cqlQuery1  = \"MATCH (n) DETACH DELETE n\"\n",
    "    nodes = graphDB_Session.run(cqlQuery1)\n",
    "    print(\"База очищена\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Формируем текст скрипта создающего ноды и связи между ними \n",
    "# Команда CREATE пишется один раз, создаваемые объекты перечисляются через запятую\n",
    "# Все в одном скрипте, мы можем использовать имена нод (h_sh, dr_vts, pr_mr, h_mk) для создания связей, не используя MATCH\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    cqlCreate = \"\"\"CREATE (h_sh:persons { name: \"Шерлок Холмс\", profession: \"Сыщик\"}),\n",
    "    (dr_vts:persons { name: \"Джон Ватсон\", profession: \"Врач\"}),\n",
    "    (pr_mr:persons { name: \"Профессор Мориарти\"}),\n",
    "    (h_mk:persons { name: \"Майкрофт Холмс\"}),\n",
    "\n",
    "    (h_sh)-[:friendship { }]->(dr_vts),\n",
    "    (dr_vts)-[:friendship { }]->(h_sh),\n",
    "    (dr_vts)-[:connect {comment: \"Описывает расследования\"}]->(h_sh),\n",
    "\n",
    "    (h_sh)-[:brother {comment: \"Брат\"}]->(h_mk),\n",
    "    (h_sh)-[:connect {comment: \"Скрытая зависть\"}]->(h_mk),\n",
    "    (h_mk)-[:brother {comment: \"Брат\"}]->(h_sh),\n",
    "\n",
    "    (h_sh)-[:connect {comment: \"Преследует\"}]->(pr_mr),\n",
    "    (pr_mr)-[:connect {comment: \"Замышляет недоброе\"}]->(h_sh) \n",
    "    \"\"\"\n",
    "\n",
    "    graphDB_Session = graphDB_Driver.session() # Получем объект \"сессия\"\n",
    "\n",
    "    graphDB_Session.run(cqlCreate) # Запускаем сприпт, создающий ноды и связи"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Посмотрим, что получилось"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Персонажи из нашего графа:\n",
      "<Record x.name='Шерлок Холмс' x.profession='Сыщик'>\n",
      "<Record x.name='Джон Ватсон' x.profession='Врач'>\n",
      "<Record x.name='Профессор Мориарти' x.profession=None>\n",
      "<Record x.name='Майкрофт Холмс' x.profession=None>\n"
     ]
    }
   ],
   "source": [
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    # Этот запрос вернет имена людей и их профессию\n",
    "    cqlQuery1  = \"MATCH (x:persons) RETURN x.name, x.profession\"\n",
    "    nodes = graphDB_Session.run(cqlQuery1)\n",
    "    print(\"Персонажи из нашего графа:\")\n",
    "    for node in nodes:\n",
    "        print(node) \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "И какие связи между персонажами и Холмсом"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Отношения Шерлока Холмса с окружающими:\n",
      "<Record y.name='Профессор Мориарти' type(r)='connect' r.comment='Преследует'>\n",
      "<Record y.name='Майкрофт Холмс' type(r)='connect' r.comment='Скрытая зависть'>\n",
      "<Record y.name='Майкрофт Холмс' type(r)='brother' r.comment='Брат'>\n",
      "<Record y.name='Джон Ватсон' type(r)='friendship' r.comment=None>\n"
     ]
    }
   ],
   "source": [
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    # Этот запрос вернет имена людей, связанных с Холмсом, тип этой связи type(r) и \n",
    "    cqlQuery2 = \"MATCH (x:persons {name:'Шерлок Холмс'})-[r]->(y:persons) RETURN y.name, type(r), r.comment\"\n",
    "    nodes = graphDB_Session.run(cqlQuery2)\n",
    "    print(\"Отношения Шерлока Холмса с окружающими:\")\n",
    "    for node in nodes:\n",
    "        print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "А сейчас посмотрим список всех врачей"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Список врачей:\n",
      "<Record x.name='Джон Ватсон' x.profession='Врач'>\n"
     ]
    }
   ],
   "source": [
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    # Query the graph    \n",
    "    cqlQuery          = \"MATCH (x:persons {profession:'Врач'}) RETURN x.name, x.profession\"\n",
    "    nodes = graphDB_Session.run(cqlQuery)\n",
    "    print(\"Список врачей:\")\n",
    "    for node in nodes:\n",
    "        print(node)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Добавим новую ноду и связи для нее\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    # Добавим графство Суссекс и отразим мечту Холмса уехать туда на покой\n",
    "    cqlCreate2 = \"\"\" CREATE (:county { name: \"Суссекс (гр)\"})\n",
    "    \"\"\"\n",
    "    graphDB_Session.run(cqlCreate2)\n",
    "\n",
    "\n",
    "    cqlCreateConn = \"\"\"MATCH (h_sh:persons{name: \"Шерлок Холмс\"}), (c_ss:county { name: \"Суссекс (гр)\"})\n",
    "    with h_sh,c_ss\n",
    "    CREATE (h_sh)-[:connects_in {conn_type: \"Мечтает о переезде\"}]->(c_ss)\n",
    "    \"\"\"\n",
    "    graphDB_Session.run(cqlCreateConn)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "И еще раз смотрим все связи с Холмсом"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Отношения Шерлока Холмса с окружающими:\n",
      "<Record y.name='Суссекс (гр)' type(r)='connects_in' r.comment=None r.conn_type='Мечтает о переезде'>\n",
      "<Record y.name='Профессор Мориарти' type(r)='connect' r.comment='Преследует' r.conn_type=None>\n",
      "<Record y.name='Майкрофт Холмс' type(r)='connect' r.comment='Скрытая зависть' r.conn_type=None>\n",
      "<Record y.name='Майкрофт Холмс' type(r)='brother' r.comment='Брат' r.conn_type=None>\n",
      "<Record y.name='Джон Ватсон' type(r)='friendship' r.comment=None r.conn_type=None>\n"
     ]
    }
   ],
   "source": [
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    # Этот запрос вернет имена людей, связанных с Холмсом, тип этой связи type(r) и \n",
    "    cqlQuery2 = \"MATCH (x:persons {name:'Шерлок Холмс'})-[r]->(y) RETURN y.name, type(r), r.comment, r.conn_type\"\n",
    "    nodes = graphDB_Session.run(cqlQuery2)\n",
    "    print(\"Отношения Шерлока Холмса с окружающими:\")\n",
    "    for node in nodes:\n",
    "        print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Задание для самостоятельного выполнения"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "    - Добавьте Мориарти статус \"Умер\". \n",
    "    - Удалите связи между ним и Холмсом"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 7. Ответы на задания"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. Задание по SQL\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Иванов Иван 0\n",
      "Сергеев Петр 0\n",
      "Иванников Захар 0\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table><tr><th>id_person</th><th>first_name</th><th>last_name</th><th>age</th><th>datecreate</th></tr><tr><td>1</td><td>Иванов</td><td>Иван</td><td>0</td><td>2019-10-13 19:45:38</td></tr><tr><td>2</td><td>Сергеев</td><td>Петр</td><td>0</td><td>2019-10-13 19:45:38</td></tr><tr><td>3</td><td>Иванников</td><td>Захар</td><td>0</td><td>2019-10-13 19:45:38</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import sqlite3 # Загружаем библиотеку\n",
    "conn = sqlite3.connect(\"testDB2.sqlite\") # Создаем соединение с базой данных (файлом с именем McScv.sqlite)\n",
    "\n",
    "# Решение\n",
    "# Если у клиента не задан возраст - задайте 0 лет.\n",
    "\n",
    "conn.row_factory = sqlite3.Row # Выбираем режим, при котором можно обращаться к полям запроса по именам\n",
    "cursor = conn.cursor( ) # Получаем “курсор” из объекта “соединение”\n",
    "\n",
    "# Текст запроса\n",
    "query = \"UPDATE RPA_Person SET age = 0 WHERE age IS NULL\"\n",
    "\n",
    "cursor.execute(query) # Выполняем запрос, аргументов в этом случае нет\n",
    "conn.commit() # Сохраняем измененения в базе\n",
    "\n",
    "cursor.execute(\"SELECT * FROM RPA_Person\")\n",
    "rows = cursor.fetchall() # Получаем объект “строки данных”\n",
    "\n",
    "for row in rows:\n",
    "    print(row['first_name'], row['last_name'], row['age'])\n",
    "sqldataToTable(rows) # Выводим все колонки в виде таблицы\n",
    "    \n",
    "cursor.close() # Закрываем “курсор”"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 2. Задание по MongoDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Выводим обновленные документы\n"
     ]
    }
   ],
   "source": [
    "import pymongo\n",
    "from pymongo import MongoClient\n",
    "    \n",
    "client = MongoClient(port=27017)  # Подключаемся к базе\n",
    " \n",
    "db=client['MyTestBase'] # Выбираем базу данных. Если ее еще нет - будет создана автоматически\n",
    " \n",
    "coll = db['MyTestColl'] # Выбираем коллекцию документов. Если ее еще нет - будет создана автоматически\n",
    "\n",
    "# Решение\n",
    "coll.update_many({}, {\"$unset\": {\"age\": 1}}) # Удаляет у всех документов поле age\n",
    " \n",
    "coll.update_many({\"last_name\":\"Мориарти\"}, {\"$set\":{\"state\": \"Умер\"}}) # Добавляем Мориарти статус “Умер”\n",
    " \n",
    "print('Выводим обновленные документы')\n",
    "for men in coll.find(): # Выводим все документы из коллекции coll\n",
    "    print (men)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3. Задание по Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "ename": "ServiceUnavailable",
     "evalue": "Failed to establish connection to ('127.0.0.1', 7687) (reason [WinError 10061] Подключение не установлено, т.к. конечный компьютер отверг запрос на подключение)",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mConnectionRefusedError\u001b[0m                    Traceback (most recent call last)",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36m_connect\u001b[1;34m(resolved_address, **config)\u001b[0m\n\u001b[0;32m    834\u001b[0m         \u001b[0mlog_debug\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"[#0000]  C: <OPEN> %s\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mresolved_address\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 835\u001b[1;33m         \u001b[0ms\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mconnect\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mresolved_address\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    836\u001b[0m         \u001b[0ms\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msettimeout\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mt\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mConnectionRefusedError\u001b[0m: [WinError 10061] Подключение не установлено, т.к. конечный компьютер отверг запрос на подключение",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m                        Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-16-2ee0f5e57d62>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[0;32m      2\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      3\u001b[0m \u001b[1;31m# Соединяемся с базой\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 4\u001b[1;33m \u001b[0mgraphDB_Driver\u001b[0m  \u001b[1;33m=\u001b[0m \u001b[0mGraphDatabase\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdriver\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0muri\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;34m\"bolt:195.201.16.200:7474\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mauth\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"neo4j\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m\"pass_for_neo4j\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      5\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      6\u001b[0m \u001b[1;31m# Решение\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neo4j\\__init__.py\u001b[0m in \u001b[0;36mdriver\u001b[1;34m(cls, uri, **config)\u001b[0m\n\u001b[0;32m    114\u001b[0m         \u001b[1;33m:\u001b[0m\u001b[1;32mclass\u001b[0m\u001b[1;33m:\u001b[0m\u001b[0;31m`\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mDriver\u001b[0m\u001b[0;31m`\u001b[0m \u001b[0msubclass\u001b[0m \u001b[0minstance\u001b[0m \u001b[0mdirectly\u001b[0m\u001b[1;33m.\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    115\u001b[0m         \"\"\"\n\u001b[1;32m--> 116\u001b[1;33m         \u001b[1;32mreturn\u001b[0m \u001b[0mDriver\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0muri\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    117\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    118\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neo4j\\__init__.py\u001b[0m in \u001b[0;36m__new__\u001b[1;34m(cls, uri, **config)\u001b[0m\n\u001b[0;32m    155\u001b[0m         \u001b[1;32mfor\u001b[0m \u001b[0msubclass\u001b[0m \u001b[1;32min\u001b[0m \u001b[0mDriver\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m__subclasses__\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    156\u001b[0m             \u001b[1;32mif\u001b[0m \u001b[0mparsed_scheme\u001b[0m \u001b[1;32min\u001b[0m \u001b[0msubclass\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0muri_schemes\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 157\u001b[1;33m                 \u001b[1;32mreturn\u001b[0m \u001b[0msubclass\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0muri\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    158\u001b[0m         \u001b[1;32mraise\u001b[0m \u001b[0mValueError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"URI scheme %r not supported\"\u001b[0m \u001b[1;33m%\u001b[0m \u001b[0mparsed\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mscheme\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    159\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neo4j\\__init__.py\u001b[0m in \u001b[0;36m__new__\u001b[1;34m(cls, uri, **config)\u001b[0m\n\u001b[0;32m    229\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    230\u001b[0m         \u001b[0mpool\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mConnectionPool\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mconnector\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0minstance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 231\u001b[1;33m         \u001b[0mpool\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mrelease\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mpool\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0macquire\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    232\u001b[0m         \u001b[0minstance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_pool\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mpool\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    233\u001b[0m         \u001b[0minstance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_max_retry_time\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mconfig\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mget\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"max_retry_time\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mdefault_config\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"max_retry_time\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36macquire\u001b[1;34m(self, access_mode)\u001b[0m\n\u001b[0;32m    717\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    718\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0macquire\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0maccess_mode\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;32mNone\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 719\u001b[1;33m         \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0macquire_direct\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    720\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    721\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36macquire_direct\u001b[1;34m(self, address)\u001b[0m\n\u001b[0;32m    610\u001b[0m                 \u001b[1;32mif\u001b[0m \u001b[0mcan_create_new_connection\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    611\u001b[0m                     \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 612\u001b[1;33m                         \u001b[0mconnection\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mconnector\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0merror_handler\u001b[0m\u001b[1;33m=\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mconnection_error_handler\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    613\u001b[0m                     \u001b[1;32mexcept\u001b[0m \u001b[0mServiceUnavailable\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    614\u001b[0m                         \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mremove\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neo4j\\__init__.py\u001b[0m in \u001b[0;36mconnector\u001b[1;34m(address, **kwargs)\u001b[0m\n\u001b[0;32m    226\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    227\u001b[0m         \u001b[1;32mdef\u001b[0m \u001b[0mconnector\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 228\u001b[1;33m             \u001b[1;32mreturn\u001b[0m \u001b[0mconnect\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mdict\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    229\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    230\u001b[0m         \u001b[0mpool\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mConnectionPool\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mconnector\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0minstance\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0maddress\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36mconnect\u001b[1;34m(address, **config)\u001b[0m\n\u001b[0;32m    974\u001b[0m         \u001b[1;32mraise\u001b[0m \u001b[0mServiceUnavailable\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"Failed to resolve addresses for %s\"\u001b[0m \u001b[1;33m%\u001b[0m \u001b[0maddress\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    975\u001b[0m     \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 976\u001b[1;33m         \u001b[1;32mraise\u001b[0m \u001b[0mlast_error\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36mconnect\u001b[1;34m(address, **config)\u001b[0m\n\u001b[0;32m    964\u001b[0m         \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    965\u001b[0m             \u001b[0mhost\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0maddress\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;36m0\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 966\u001b[1;33m             \u001b[0ms\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0m_connect\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mresolved_address\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    967\u001b[0m             \u001b[0ms\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mder_encoded_server_certificate\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0m_secure\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0ms\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mhost\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0msecurity_plan\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mssl_context\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    968\u001b[0m             \u001b[0mconnection\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0m_handshake\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0ms\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0maddress\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mder_encoded_server_certificate\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mconfig\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\program files\\python36\\lib\\site-packages\\neobolt\\direct.py\u001b[0m in \u001b[0;36m_connect\u001b[1;34m(resolved_address, **config)\u001b[0m\n\u001b[0;32m    845\u001b[0m         \u001b[0mlog_debug\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"[#0000]  C: <CLOSE> %s\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mresolved_address\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    846\u001b[0m         \u001b[0ms\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 847\u001b[1;33m         \u001b[1;32mraise\u001b[0m \u001b[0mServiceUnavailable\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"Failed to establish connection to {!r} (reason {})\"\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mresolved_address\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0merror\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    848\u001b[0m     \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    849\u001b[0m         \u001b[1;32mreturn\u001b[0m \u001b[0ms\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mServiceUnavailable\u001b[0m: Failed to establish connection to ('127.0.0.1', 7687) (reason [WinError 10061] Подключение не установлено, т.к. конечный компьютер отверг запрос на подключение)"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase # Подключаем библиотеку с драйвером БД\n",
    "\n",
    "# Соединяемся с базой\n",
    "graphDB_Driver  = GraphDatabase.driver(uri = \"bolt:195.201.16.200:7474\", auth=(\"neo4j\", \"pass_for_neo4j\"))\n",
    "\n",
    "# Решение\n",
    "# Добавьте Мориарти статус \"Умер\"\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    cqlQuery2 = \"MATCH (n:persons{name: 'Профессор Мориарти'}) RETURN n\"\n",
    "    nodes = graphDB_Session.run(cqlQuery2)\n",
    "\n",
    "    print(\"Информация о Мориарти до добавления статуса:\")\n",
    "    for node in nodes:\n",
    "        print(node)\n",
    "        \n",
    "    cqlQuery2 = \"MATCH (n:persons{name: 'Профессор Мориарти'}) SET n.state = 'Умер' RETURN n\"\n",
    "    nodes = graphDB_Session.run(cqlQuery2)\n",
    "\n",
    "    print(\"Информация о Мориарти:\")\n",
    "    for node in nodes:\n",
    "        print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Решение\n",
    "# Удалите связи между ним и Холмсом\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    cqlQuery2 = \"MATCH (x:persons {name:'Профессор Мориарти'})-[r]->(y) RETURN y.name, type(r), r.comment\"\n",
    "    nodes = graphDB_Session.run(cqlQuery2)\n",
    "    \n",
    "    print(\"Отношения Мориарти с окружающими до обновления:\")\n",
    "    for node in nodes:\n",
    "        print(node)\n",
    "        \n",
    "    cqlDelQuery = \"MATCH (x:persons {name:'Профессор Мориарти'})-[r]->(y:persons {name:'Шерлок Холмс'}) DETACH DELETE r\"\n",
    "    graphDB_Session.run(cqlDelQuery)\n",
    "\n",
    "    cqlQuery2 = \"MATCH (x:persons {name:'Профессор Мориарти'})-[r]->(y) RETURN y.name, type(r), r.comment\"\n",
    "    nodes = graphDB_Session.run(cqlQuery2)\n",
    "    \n",
    "    print(\"Отношения Мориарти с окружающими:\")\n",
    "    for node in nodes:\n",
    "        print(node)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
